tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "mobile-dev-inc/tap"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "sass/sass"
tap "sst/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "tw93/tap"
tap "xdevplatform/tap"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Arbitrary precision numeric processing language
brew "bc"
# Toolchain of the web
brew "biome"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Binary installation for rust projects
brew "cargo-binstall"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# DuckDuckGo from the terminal
brew "ddgr"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Run arbitrary commands when files change
brew "entr"
# Speech synthesizer that supports more than hundred languages and accents
brew "espeak-ng"
# Modern, maintained replacement for ls
brew "eza"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Portable Foreign Function Interface library
brew "libffi"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# LLM inference in C/C++
brew "llama.cpp"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Polyglot tool version manager
brew "mise"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Modern shell for the GitHub era
brew "nushell"
# Smart, Fast and Extensible Build System
brew "nx"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@16"
# Generic machine emulator and virtualizer
brew "qemu"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.3"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# SOund eXchange: universal sound sample translator
brew "sox"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# The easiest way to automate UI testing for your mobile app
brew "mobile-dev-inc/tap/maestro"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Google CLI for Gmail, Calendar, Drive, Docs, Sheets, and more
brew "steipete/tap/gogcli"
# Modern Go client + CLI for the Google Places API (New)
brew "steipete/tap/goplaces"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Download and manage your addons and mods
cask "curseforge"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Text editor
cask "emacs-app"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Utility to hide menu bar items
cask "hiddenbar"
# Secure video conferencing app
cask "jitsi-meet"
# 2D game framework for Lua
cask "love"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App for launching iOS and Android simulators
cask "minisim"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# GUI client for PostgreSQL databases
cask "postico"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# AI image upscaler
cask "upscayl"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Auth-enabled curl-like CLI for the X API
cask "xdevplatform/tap/xurl"
# Gecko based web browser
cask "zen"
